{
  "id": "yuelao",
  "name": "Yuelao",
  "image": "/heroes/yuelao.webp",
  "faction": "Hearts",
  "role": "Arcane",
  "class": "Support",
  "rarity": "Legendary",
  "description": "Yuelao, god of romance and marriage, uses his red threads to unite destined couples.",
  "ratings": {
    "overall": "S",
    "grimSurge": "S",
    "delusionsDen": "A",
    "torrentRift": "B",
    "pvp": "A",
    "odyssey": "B"
  },
  "recommendedRelicLevel": 10,
  "stats": {
    "hp": 252926,
    "atk": 25451,
    "armor": 5257,
    "magicRes": 5144,
    "dodgeRate": 7,
    "hitBonus": 0,
    "critRate": 4,
    "critRes": 8,
    "critDmgBonus": 0,
    "critDmgReduction": 0,
    "energy": 0
  },
  "skills": [
    {
      "id": "skill_1",
      "name": "Fated Affection",
      "description": "Yuelao heals several allies in sequence, each heal restoring HP equal to 140% of ATK, repeating 6 times. If a linked unit is healed, the other linked unit also receives the healing.",
      "upgrades": {
        "level2": "Each heal restores HP equal to 160% of ATK.",
        "level3": "Allies healed gain 20% increased CRIT Rate for 5s. This effect cannot stack on the same target.",
        "level4": "It now heals 8 times."
      },
      "image": "/skills/yuelao_skill_1.webp"
    },
    {
      "id": "skill_2",
      "name": "Red Thread of Fate",
      "description": "Yuelao links the ally with the highest ATK and the ally with the highest HP with a red thread, making them share 10% of their ATK, HP, Armor, and M-RES. This skill refunds its CD if no valid targets exist.",
      "upgrades": {
        "level2": "Increases the shared attributes to 12.5%.",
        "level3": "If one linked ally falls, they transfer 50% of their remaining Energy to the other.",
        "level4": "Increases the shared attributes to 15%."
      },
      "image": "/skills/yuelao_skill_2.webp"
    },
    {
      "id": "skill_3",
      "name": "Bond of Fated Pair",
      "description": "Yuelao increases the ATK of the ally with the highest ATK by 15% for 8s and restores 150 Energy to them. If that ally is linked, Yuelao will also increase the ATK of the other linked ally and restore their Energy.",
      "upgrades": {
        "level2": "Increases ATK bonus to 20%.",
        "level3": "Energy Regen increases to 180.",
        "level4": "Increases ATK bonus to 25%. (Unlocks at Lv.261)"
      },
      "image": "/skills/yuelao_skill_3.webp"
    },
    {
      "id": "skill_4",
      "name": "Lanterns of Destiny",
      "description": "Yuelao restores HP equal to 200% of ATK to the most vulnerable ally. If that ally is linked, Yuelao will also restore HP to the other linked ally.",
      "upgrades": {
        "level2": "Restores HP equal to 220% ATK.",
        "level3": "Increases the allies' CRIT RES by 30% for 6s.",
        "level4": "Restores HP equal to 250% ATK. (Unlocks at Lv.281)"
      },
      "image": "/skills/yuelao_skill_4.webp"
    }
  ],
  "relic": {
    "name": "Fate Bound",
    "description": "The linked unit with the highest max HP will take 20% of the DMG dealt to the linked unit with the highest ATK. The linked unit with the highest ATK restores HP equal to 20% of the DMG dealt to the unit with the highest HP when dealing DMG.",
    "upgrades": {
      "level2": "When both linked units attack the same target, they deal an additional 15% DMG.",
      "level3": "The ally with the highest HP takes 30% of the DMG dealt to the ally with the highest ATK. (Unlock at Relic Lv.20)",
      "level4": "The ally with the highest ATK restores HP equal to 30% of the DMG they deal to the ally with the highest HP. (Unlock at Relic Lv.30)"
    },
    "image": "/skills/yuelao_relic.webp"
  }
}